snlkuharlocal/src/DataProcessors/ЗагрузкаОтчетовОНанесенииКМ/ЗагрузкаОтчетовОНанесенииКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаОтчетовОНанесенииКМ</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбЗПС</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДоков_Маркировка/СтатусыДоков_Маркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоков_Маркировка</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеКодов</name>
  </enumValues>
  <enumValues>
    <name>КодыПолучены</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеАТК</name>
  </enumValues>
  <enumValues>
    <name>АТКСформирован</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ВыпущеноТаможней</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <comment>Маркировка товаров ИСМП</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.ЛистНабора</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.МаркировкаТоваровИСМП</basedOn>
  <basedOn>Document.КонтрактСПроизводителем</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ВыданныеКодыАгрегаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииИСМП</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортерИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращаемыйТоварБылОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКодовSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>фКодыАгрегацийДляПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАгрегации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАгрегации</name>
      <type>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ОтчетКассовойСмены</types>
        <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.Инвентаризация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.СписаниеТМЦ</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
        <types>DocumentRef.Машина</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ЗагрузкаОтчетовОНанесенииКМ/Forms/ФормаОсновная/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью(); 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПолныйПуть=Истина;	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбораФайла.Фильтр						=	"Файл данных (*.json)|*.json";
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.Расширение					=	"json";
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Файл	= Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Объект.ИмяФайла = ?(ПолныйПуть,Файл.ПолноеИмя,Файл.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	Объект.ВыбЗПС = Неопределено; 
КонецПроцедуры

&НаКлиенте
Процедура ргНумерацияКоробокПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьДанныеФайла(Команда)
	
	ТабДокДополнительно = Новый ТабличныйДокумент();
	ИмяТД = ""; 
	РЧтения = ПрочитатьКодыНаКлиенте(); 
	ПроверитьДанныеФайлаНаСервере(РЧтения,ТабДокДополнительно,ИмяТД); 	
	Если ЗначениеЗаполнено(ИмяТД) Тогда
		ТабДокДополнительно.Показать(ИмяТД); 	
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура кнСравнитьОтчетСПланом(Команда)
	РЧтения = ПрочитатьКодыНаКлиенте();
	кнСравнитьОтчетСПланомНаСервере(РЧтения);
КонецПроцедуры

&НаКлиенте
Процедура кнПоказатьДанныеФайла(Команда)
	ТДокумент = Новый ТабличныйДокумент();
	РЧтения = ПрочитатьКодыНаКлиенте(); 
	кнПоказатьДанныеФайлаНаСервере(РЧтения,ТДокумент);
	ТДокумент.Показать("Данные файла: " + Объект.ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура кнСоздатьБронированиеКоробок(Команда)
	Если Не ЗначениеЗаполнено(Объект.ВыбЗПС) Тогда
		ПоказатьПредупреждение(, "Не выбран заказ поставщику !");	
		Возврат;
	КонецЕсли;
	
	Если ЕстьОбработанныеАгрегации(Объект.ВыбЗПС) Тогда
		ТекстОшибки = СтрШаблон("К ЗПС %1 уже оформлены агрегации !", Объект.ВыбЗПС);
		ПоказатьПредупреждение(, ТекстОшибки);	
		Возврат;			
	КонецЕсли;
	РЧтения = ПрочитатьКодыНаКлиенте();
	кнСоздатьБронированиеКоробокНаСервере(РЧтения);
КонецПроцедуры

&НаКлиенте
Процедура кнВынутьКоробки(Команда)
	РЧтения = ПрочитатьКодыНаКлиенте();
	кнВынутьКоробкиНаСервере(РЧтения);
КонецПроцедуры

&НаКлиенте
Процедура кнЗаменитьКодыВФайле(Команда)
	ТДокумент = Новый ТабличныйДокумент();
	РЧтения = ПрочитатьКодыНаКлиенте();
	Ошибки = "";
	НовоеИмяФайла = "";
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда
		Ошибки = "Не указано имя файла отчета !";
	Иначе
		Файл = Новый Файл(Объект.ИмяФайла);	
		Если Файл.Существует() Тогда
			Если Файл.ЭтоКаталог() Тогда
				Ошибки = "Должно быть указано имя файла а не каталога !";
			Иначе
				НовоеИмяФайла = Файл.Путь+Файл.ИмяБезРасширения+"_Нов"+Файл.Расширение;
			КонецЕсли;
		Иначе
			Ошибки = "Указанный файл отчета не существует !";
		КонецЕсли;
	КонецЕсли;
	Коробки = Неопределено; 
	кнЗаменитьКодыВФайлеНаСервере(РЧтения,Коробки, ТДокумент); 
	Если Коробки = неопределено Тогда
	
		Возврат; 
	
	КонецЕсли;
	Данные 	= Новый Структура("aggregationUnits", Коробки); 
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл(НовоеИмяФайла); 
	ЗаписатьJSON(Запись, Данные);	
	Запись.Закрыть(); 
	Сообщить("Сформирован файл: " + НовоеИмяФайла, СтатусСообщения.Информация);
	
	ТДокумент.ОтображатьСетку		= Ложь;
	ТДокумент.ОтображатьЗаголовки	= Ложь;
	ТДокумент.Показать("Замена кодов в файле.");
	
КонецПроцедуры

&НаКлиенте
Процедура кнСоздатьХКМ(Команда)
	кнСоздатьХКМНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура кнВыгрузитьАгрегацию(Команда)
	ДанныеВыгрузки = кнВыгрузитьАгрегациюНаСервере();
	ДДанные = ПолучитьДвоичныеДанныеИзСтроки(МаркировкаКС.ЗаписатьЖСОН(ДанныеВыгрузки));
	ДДанные.Записать(Объект.ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура кнЗаполнитьСоставАгрегационныхКодов(Команда)
	кнЗаполнитьСоставАгрегационныхКодовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура кнПрописатьНоменклатуруВАК(Команда)
	кнПрописатьНоменклатуруВАКНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура кнЗарегитьКодыПоЗаказу(Команда)   
      
	кнЗарегитьКодыПоЗаказуНаСервере();
	
	
КонецПроцедуры

&НаКлиенте
Процедура кнЗарегистрироватьКоробкиПоЗПС(Команда)
	
	кнЗарегистрироватьКоробкиПоЗПСНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДанныеФайла_2(Команда)
	ТабДокДополнительно = Новый ТабличныйДокумент();
	ИмяТД = "";
	РЧтения = ПрочитатьКодыНаКлиенте(); 
	ПроверитьДанныеФайла_2НаСервере(РЧтения,ТабДокДополнительно,ИмяТД); 	
	Если ЗначениеЗаполнено(ИмяТД) Тогда
		ТабДокДополнительно.Показать(ИмяТД); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнПоказатьДанныеФайла_2(Команда)
	ТабДокумент = Новый ТабличныйДокумент();
	РЧтения = ПрочитатьКодыНаКлиенте();
	кнПоказатьДанныеФайла_2НаСервере(РЧтения,ТабДокумент);
	ТабДокумент.Показать("Данные файла: " + Объект.ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура кнЗаполнитьЗПС(Команда)
	
	ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаОчиститьЗПС", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеВопрос, "Товары по ЗПС будут заменены данными из файла, продолжить?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПослеОтветаОчиститьЗПС(ОтветНаВопрос,ДопПараметры) Экспорт
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		РЧтения = ПрочитатьКодыНаКлиенте(); 
		кнЗаполнитьЗПСНаСервере(РЧтения);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьДанныеФайлаНаСервере(РДанныеДляЧтения,ТабДокДополнительно = неопределено,ИмяТД = "")
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1); 
//	РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла);

	Если рЧтения.Успешно Тогда
		Сообщить(СтрШаблон("Прочитано: %1 кодов, %2 коробок.", рЧтения.Данные.КолКодовШтук,
			рЧтения.Данные.КолКодовКоробок));

		РПроверок = ПроверитьДанныеФайлаСПроверкой(рЧтения.Данные.МВТ);
		ВывестиРезультатыПроверок(рПроверок);
	Иначе
		МаркировкаКС.ВывестиОшибки(рЧтения);

		НеНайденныеКоды = МаркировкаКС.ПолучитьЗначениеПараметра(рЧтения.Данные, "НеНайденныеКоды");
		Если НеНайденныеКоды <> Неопределено Тогда
			ТабДокДополнительно = Новый ТабличныйДокумент;

			Обр 			= Обработки.ПроверкаКарточекДляНК.Создать();
			ДопПараметры	= Новый Структура("ТД_Результат,ВнешниеДанные", ТабДокДополнительно,
				Новый Структура("Данные", НеНайденныеКоды));

			Обр.ВывестиСхемуВТД(ОбработкаОбъект.ПолучитьМакет("НеНайденныеКоды"), "Основной", , ДопПараметры);				
			
			//ТД.Показать("Не найденные коды штук");
			ИмяТД = "Не найденные коды штук";
			
			ТДокумент = Элементы.ТД_ОшибочныеКодыШтук;
			ТДокумент.Очистить();
			ТДокумент = ТабДокДополнительно; 
			
		КонецЕсли;

		НеНайденныеКодыКоробок = МаркировкаКС.ПолучитьЗначениеПараметра(рЧтения.Данные, "НеНайденныеКодыКоробок");
		Если НеНайденныеКодыКоробок <> Неопределено Тогда
			ТабДокДополнительно = Новый ТабличныйДокумент;

			Обр 			= Обработки.ПроверкаКарточекДляНК.Создать();
			ДопПараметры	= Новый Структура("ТД_Результат,ВнешниеДанные", ТабДокДополнительно,
				Новый Структура("Данные", НеНайденныеКодыКоробок));

			Обр.ВывестиСхемуВТД(ОбработкаОбъект.ПолучитьМакет("НеНайденныеКоды"), "Основной", , ДопПараметры);

			//ТД.Показать("Не найденные коды коробок.");
			ИмяТД = "Не найденные коды коробок.";
			
			ТДокумент = Элементы.ТД_ОшибочныеКодыКоробок; 
			ТДокумент.Очистить();
			ТДокумент = ТабДокДополнительно; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьДанныеФайлаСПроверкой(МВТ)	
	
	РПроверок = Новый Массив;
	
	рПроверок.Добавить(ВыполнитьШагПроверки_НаличиеКодовШтук(МВТ));
	Если ргНумерацияКоробок = 0 Тогда //Наша нумерация
		рПроверок.Добавить(ВыполнитьШагПроверки_НаличиеКодовКоробок(МВТ));
	Иначе
		рПроверок.Добавить(ВыполнитьШагПроверки_ОтсутствиеКодовКоробок(МВТ));
	КонецЕсли;	
	рПроверок.Добавить(ВыполнитьШагПроверки_ДублиКодовШтук(МВТ));
	//++Данилова Е.В. 13.05.2026 ASU-2790
	Если ВидОперации = 0 Тогда 
		рПроверок.Добавить(ВыполнитьШагПроверки_КоличествоНоменклатуры(МВТ, Объект.ВыбЗПС));
	Иначе 
		рПроверок.Добавить(ВыполнитьШагПроверки_НайденыДокументыПоГУИД(МВТ));	
	КонецЕсли;
	//--Данилова Е.В. 13.05.2026 
	Возврат рПроверок;
	
КонецФункции

&НаСервере
Функция ВывестиРезультатыПроверок(РПроверок)
	
	ТД_Результат.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	Макет = ОбработкаОбъект.ПолучитьМакет("ОтчетОПроверке");
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(Новый Структура("ИмяФайла,ЗаказПоставщику", Объект.ИмяФайла, Объект.ВыбЗПС));
	
	ТД_Результат.Вывести(ОблЗаголовок);
	
	ТД_Результат.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Для Каждого рШага Из рПроверок Цикл		
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ОблРезультат = ОблСтрока.Область(1,4);
		
		пОбласти = Новый Структура("ИмяШага,Ошибки,Результат", рШага.Данные.Имя, СтрСоединить(рШага.Ошибки, Символы.ПС));
		ДопИнфо = МаркировкаКС.ПолучитьЗначениеПараметра(рШага.Данные, "ДопИнфо", Новый Структура);
		
		Если рШага.Успешно = Неопределено Тогда
			пОбласти.Результат = "Не выполнялась";					
			ОблРезультат.ЦветФона = WebЦвета.Желтый;
		ИначеЕсли рШага.Успешно = Истина Тогда
			пОбласти.Результат = "Успешно";					
			ОблРезультат.ЦветФона = WebЦвета.ЗеленыйЛес;
		ИначеЕсли рШага.Успешно = Ложь Тогда
			пОбласти.Результат = "Ошибка";					
			ОблРезультат.ЦветФона = WebЦвета.Розовый;			
		КонецЕсли; 
		
		Сообщить("" + рШага.Данные.Имя	+ " " + рШага.Успешно);
		
		ОблСтрока.Параметры.Заполнить(пОбласти);
		ОблСтрока.Параметры.Заполнить(ДопИнфо);
		
		ТД_Результат.Вывести(ОблСтрока);
	КонецЦикла; 
КонецФункции //ВывестиРезультатыПроверок(рПроверок) 

&НаСервере
Функция ВыполнитьШагПроверки_НаличиеКодовШтук(МВТ)
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Структура("Имя,МакетОтчета,рЗапроса", "Наличие кодов штук", "НеНайденныеКоды", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "	 
	|ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Количество ИЗ ВТ_РезультатыПоиска
	|ГДЕ ШтрихКодУпаковки.ВерсияДанных ЕСТЬ NULL	 
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(СтрШаблон("Не найдено %1 кодов маркировки.", Выборка.Количество));
		
		Запрос.Текст = "
		|ВЫБРАТЬ КодКоробки,КодУпаковки,1 КАК Количество ИЗ ВТ_РезультатыПоиска
		|ГДЕ ШтрихКодУпаковки.ВерсияДанных ЕСТЬ NULL	 
		|";
		
		Результат.Данные.рЗапроса = Запрос.Выполнить();
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции //ВыполнитьШагПроверки_НеНайденныеКодыШтук(МВТ) 
&НаСервере
Функция ВыполнитьШагПроверки_НаличиеКодовКоробок(МВТ)
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Структура("Имя,МакетОтчета,рЗапроса", "Наличие кодов коробок", "НеНайденныеКодыКоробок",
		Неопределено);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "	 
				   |ВЫБРАТЬ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодКоробки) КАК Количество ИЗ ВТ_РезультатыПоиска
				   |ГДЕ ШтрихКодКоробки.ВерсияДанных ЕСТЬ NULL	 
				   |";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(СтрШаблон("Не найдено %1 кодов коробок.", Выборка.Количество));

		Запрос.Текст = "
					   |ВЫБРАТЬ КодКоробки,КодУпаковки,1 КАК Количество ИЗ ВТ_РезультатыПоиска
					   |ГДЕ ШтрихКодКоробки.ВерсияДанных ЕСТЬ NULL	 
					   |";

		Результат.Данные.рЗапроса = Запрос.Выполнить();
	КонецЕсли;

	Возврат Результат;	
КонецФункции //ВыполнитьШагПроверки_НаличиеКодовКоробок(МВТ)
&НаСервере
Функция ВыполнитьШагПроверки_ОтсутствиеКодовКоробок(МВТ)
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Структура("Имя,МакетОтчета,рЗапроса", "Отсутствие кодов коробок",
		"НеНайденныеКодыКоробок", Неопределено);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "	 
				   |ВЫБРАТЬ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодКоробки) КАК Количество ИЗ ВТ_РезультатыПоиска
				   |ГДЕ НЕ ШтрихКодКоробки.ВерсияДанных ЕСТЬ NULL	 
				   |";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(СтрШаблон("Не найдено %1 кодов коробок.", Выборка.Количество));

		Запрос.Текст = "
					   |ВЫБРАТЬ КодКоробки, СУММА(1) КАК Количество ИЗ ВТ_РезультатыПоиска
					   |ГДЕ 
					   |	НЕ ШтрихКодКоробки.ВерсияДанных ЕСТЬ NULL	 
					   |СГРУППИРОВАТЬ ПО
					   |	КодКоробки
					   |";

		Результат.Данные.рЗапроса = Запрос.Выполнить();
	КонецЕсли;

	Возврат Результат;	
КонецФункции
&НаСервере
Функция ВыполнитьШагПроверки_ДублиКодовШтук(МВТ)
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Структура("Имя,МакетОтчета,рЗапроса", "ДублиКодовШтук", "ДублиКодовШтук", Неопределено);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "	 
				   |ВЫБРАТЬ КодУпаковки, СУММА(1) КАК КоличествоДублей ИЗ ВТ_РезультатыПоиска
				   |СГРУППИРОВАТЬ ПО КодУпаковки
				   |ИМЕЮЩИЕ СУММА(1)>1
				   |";

	ДублированоКодов = 0;
	рЗапроса = Запрос.Выполнить();
	Выборка = рЗапроса.Выбрать();
	ДублированоКодов = Выборка.Количество();

	Если ДублированоКодов > 1 Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(СтрШаблон("Найдено %1 дублированых кодов штук.", ДублированоКодов));

		Результат.Данные.рЗапроса = рЗапроса;
	КонецЕсли;

	Возврат Результат;	
КонецФункции

&НаСервере
Функция ВыполнитьШагПроверки_КоличествоНоменклатуры(МВТ, ЗаказПоставщику)
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Структура("Имя,МакетОтчета,рЗапроса", "Общее кол-во номенклатуры", "ДублиКодовШтук",
		Неопределено);

	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Результат.Успешно = Неопределено;
		Результат.Сообщения.Добавить("Не выбран заказ поставщику.");
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "	 
				   |ВЫБРАТЬ
				   |	Номенклатура,
				   |	СУММА(КолОтчет) КАК КолОтчет,
				   |	СУММА(КолЗПС) КАК КолЗПС
				   |ИЗ
				   |(
				   |ВЫБРАТЬ 
				   |	ШтрихКодУпаковки.Владелец	КАК Номенклатура,
				   |	СУММА(1)					КАК КолОтчет,
				   |	0							КАК КолЗПС
				   |ИЗ 
				   |	ВТ_РезультатыПоиска
				   |СГРУППИРОВАТЬ ПО 
				   |	ШтрихКодУпаковки.Владелец
				   |ОБЪЕДИНИТЬ ВСЕ
				   |ВЫБРАТЬ
				   |	Номенклатура,
				   |	0		        КАК КолОтчет,
				   |	Количество 		КАК Количество
				   |ИЗ
				   |	" + ЗаказПоставщику.Метаданные().ПолноеИмя() + ".Товары
																	   |ГДЕ
																	   |	Ссылка = &ЗаказПоставщику
																	   |) КАК Сводный	
																	   |СГРУППИРОВАТЬ ПО
																	   |	Номенклатура
																	   |";

	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);

	КолКодовШтукЗПС			= 0;
	КолКодовШтукОтчет	    = 0;

	РЗапроса = Запрос.Выполнить();
	Выборка = рЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КолОтчет <> Выборка.КолЗПС Тогда
			Результат.Успешно = Ложь;
		КонецЕсли;

		КолКодовШтукЗПС			= КолКодовШтукЗПС + Выборка.КолЗПС;
		КолКодовШтукОтчет	    = КолКодовШтукОтчет + Выборка.КолОтчет;
	КонецЦикла;

	Если Не Результат.Успешно Тогда
		Результат.Ошибки.Добавить(СтрШаблон("Не совпадает количество по отчету и ЗПС !"));
		Результат.Данные.рЗапроса = рЗапроса;
	КонецЕсли;

	Результат.Данные.Вставить("ДопИнфо", Новый Структура("КолКодовШтукЗПС,КолКодовШтукОтчет", КолКодовШтукЗПС,
		КолКодовШтукОтчет));

	Возврат Результат;	
КонецФункции


&НаСервере
Процедура УправлениеВидимостью()
	Элементы.ФормакнСоздатьБронированиеКоробок.Видимость = ргНумерацияКоробок = 1; 
	//++Данилова Е.В. 13.05.2026 ASU-2790
	Элементы.ФормаГруппаЗаполнениеЗПС.Видимость 	= ВидОперации = 1;
	Элементы.ФормаГруппаБронирование.Видимость	 	= ВидОперации = 0;
	Элементы.ГруппаОтладка.Видимость = ВидОперации 		= 0;
	Элементы.ГруппаЗаменаКодов.Видимость = ВидОперации 	= 0;
	Элементы.ВыбЗПС.Видимость = ВидОперации = 0;
	Элементы.ргНумерацияКоробок.Видимость = ВидОперации = 0;
	//--Данилова Е.В. 13.05.2026 
КонецПроцедуры

&НаСервере
Процедура кнСравнитьОтчетСПланомНаСервере(РДанныеДляЧтения)
	Если Не ЕстьПлановыеАгрегации() Тогда
		Сообщить("Не найдено плановых агрегаций к ЗПС: " + Объект.ВыбЗПС, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла);

	Если Не рЧтения.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рЧтения);
		Возврат;
	КонецЕсли;

	Сообщить(СтрШаблон("Прочитано: %1 кодов, %2 коробок.", рЧтения.Данные.КолКодовШтук, рЧтения.Данные.КолКодовКоробок));

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = рЧтения.Данные.МВТ;

	Запрос.Текст = "		
				   |ВЫБРАТЬ
				   |	ШтрихкодКоробки,
				   |	ШтрихкодУпаковки
				   |ПОМЕСТИТЬ ВТ_ДанныеАгрегаций
				   |ИЗ
				   |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
				   |ГДЕ
				   |	Ссылка.ВидОперации = &ВидОперации
				   |	И Ссылка.ДокументОснование = &ДокументОснование
				   |ИНДЕКСИРОВАТЬ ПО ШтрихкодКоробки,ШтрихкодУпаковки
				   |;		
				   |ВЫБРАТЬ 
				   |	ВЫБОР 
				   |		КОГДА 
				   |			НЕ ВТ_ДанныеАгрегаций.ШтрихкодКоробки ЕСТЬ NULL
				   |			И НЕ ВТ_ДанныеАгрегаций.ШтрихкодУпаковки ЕСТЬ NULL 
				   |		ТОГДА Истина
				   |		ИНАЧЕ Ложь
				   |	КОНЕЦ КАК ЕстьВАгрегациях,
				   |	IsNULL(ВТ_ДанныеАгрегаций.ШтрихкодКоробки, ВТ_РезультатыПоиска.ШтрихкодКоробки) 		КАК ШтрихкодКоробки,
				   |	ВТ_РезультатыПоиска.ШтрихкодУпаковки	КАК ШтрихкодУпаковки_Файл,		
				   |	ВТ_ДанныеАгрегаций.ШтрихкодУпаковки		КАК ШтрихкодУпаковки_Агрегации,
				   |	IsNULL(ВТ_РезультатыПоиска.Количество,0) 	КАК Количество_Файл
				   |ИЗ
				   |	ВТ_ДанныеАгрегаций
				   |ПОЛНОЕ СОЕДИНЕНИЕ		
				   |	ВТ_РезультатыПоиска
				   |ПО
				   |	ВТ_РезультатыПоиска.ШтрихкодКоробки = ВТ_ДанныеАгрегаций.ШтрихкодКоробки			
				   |	И ВТ_РезультатыПоиска.ШтрихкодУпаковки = ВТ_ДанныеАгрегаций.ШтрихкодУпаковки			
				   |ГДЕ
				   |	ВТ_ДанныеАгрегаций.ШтрихкодКоробки 				ЕСТЬ NULL
				   |	ИЛИ ВТ_ДанныеАгрегаций.ШтрихкодУпаковки			ЕСТЬ NULL
				   |	ИЛИ ВТ_РезультатыПоиска.ШтрихкодКоробки 		ЕСТЬ NULL
				   |	ИЛИ ВТ_РезультатыПоиска.ШтрихкодУпаковки 		ЕСТЬ NULL
				   |	ИЛИ ВТ_РезультатыПоиска.ШтрихкодКоробки.Владелец <> ВТ_РезультатыПоиска.ШтрихкодУпаковки.Владелец
				   |УПОРЯДОЧИТЬ ПО
				   |	IsNULL(ВТ_ДанныеАгрегаций.ШтрихкодКоробки.Наименование, ВТ_РезультатыПоиска.ШтрихкодКоробки.Наименование),
				   |	IsNULL(ВТ_ДанныеАгрегаций.ШтрихкодУпаковки.Наименование, ВТ_РезультатыПоиска.ШтрихкодУпаковки.Наименование)
				   |";

	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийМаркировки.Агрегация);
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ВыбЗПС);

	РЗапроса = Запрос.Выполнить();
	Выборка = рЗапроса.Выбрать();	

	Обр 			= Обработки.ПроверкаКарточекДляНК.Создать();
	ДопПараметры	= Новый Структура("ТД_Результат,ВнешниеДанные", ТД_Результат,
		Новый Структура("Данные", рЗапроса));

	Обр.ВывестиСхемуВТД(ОбработкаОбъект.ПолучитьМакет("СравнениеОтчетаОНанесении"), "Основной", ,
		ДопПараметры);  
		
    Запрос.МенеджерВременныхТаблиц = рЧтения.Данные.МВТ;
	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	ВТ_ДанныеФайла.ШтрихкодУпаковки 	КАК ШтрихкодУпаковки_файл,
				   |	ВТ_ДанныеАгрегаций.ШтрихкодУпаковки	КАК ШтрихкодУпаковки_Заказ
				   |ИЗ
				   |	ВТ_ДанныеФайла
				   |ПОЛНОЕ СОЕДИНЕНИЕ
				   |	ВТ_ДанныеАгрегаций
				   |ПО
				   |	ВТ_ДанныеФайла.ШтрихкодУпаковки = ВТ_ДанныеАгрегаций.ШтрихкодУпаковки
				   |ГДЕ
				   |	ВТ_ДанныеФайла.ШтрихкодУпаковки ЕСТЬ NULL
				   |	ИЛИ ВТ_ДанныеАгрегаций.ШтрихкодУпаковки ЕСТЬ NULL
				   |";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Сообщить("КМ штук отчета совпадают с кодами из агрегаций заказа.", СтатусСообщения.Информация);
	КонецЕсли;

КонецПроцедуры
&НаСервере
Функция ЕстьПлановыеАгрегации()
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК КолАгрегаций
				   |ИЗ
				   |	Документ.МаркировкаТоваровИСМП 
				   |ГДЕ
				   |	ДокументОснование = &ДокументОснование
				   |	И ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)	
				   |	И Статус В (&Статусы)
				   |	И Проведен
				   |";

	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки);
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.Обрабатывается);
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.Обработан);
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки);

	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ВыбЗПС);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КолАгрегаций))

КонецФункции

&НаСервере
Процедура кнПоказатьДанныеФайлаНаСервере(РДанныеДляЧтения,ТабДокумент = Неопределено)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла);
	Если Не рЧтения.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рЧтения);
		Возврат;
	КонецЕсли;

	Сообщить(СтрШаблон("Прочитано: %1 кодов, %2 коробок.", рЧтения.Данные.КолКодовШтук, рЧтения.Данные.КолКодовКоробок));

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = рЧтения.Данные.МВТ;
	Запрос.Текст = "
				   |ВЫБРАТЬ 
				   |	ШтрихкодУпаковки.Владелец.Родитель 	КАК Модель,
				   |	ШтрихкодУпаковки.Владелец 			КАК Номенклатура,
				   |	ШтрихкодКоробки,		
				   |	СУММА(1) КАК КоличествоФайл,
				   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки.Владелец) КАК КолПозицийВКоробке
				   |ИЗ 
				   |	ВТ_РезультатыПоиска 
				   |СГРУППИРОВАТЬ ПО 
				   |	ШтрихкодУпаковки.Владелец,
				   |	ШтрихкодКоробки
				   |";

	ТабДокумент = Новый ТабличныйДокумент;

	РЗапроса		= Запрос.Выполнить();

	ПараметрыДанных	= Новый Структура("ЗПС_Ссылка", Объект.ВыбЗПС);
	ДопПараметры	= Новый Структура("ТД_Результат,ВнешниеДанные", ТабДокумент, Новый Структура("ДанныеОтчета",
		рЗапроса));

	Обр 			= Обработки.ПроверкаКарточекДляНК.Создать();
	Обр.ВывестиСхемуВТД(ОбработкаОбъект.ПолучитьМакет("СодержимоеОтчетаОНанесении"), "Основной",
		ПараметрыДанных, ДопПараметры);		
	
	
КонецПроцедуры

&НаСервере
Функция ЕстьОбработанныеАгрегации(ЗаказПоставщику)
	Запрос = Новый Запрос;
	Запрос.Текст = "
				   |ВЫБРАТЬ ПЕРВЫЕ 1
				   |	Ссылка
				   |ИЗ
				   |	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
				   |ГДЕ
				   |	ДокументОснование = &ЗаказПоставщику	
				   |	И ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
				   |	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
				   |	И Проведен
				   |";

	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка));
КонецФункции
&НаСервере
Процедура кнСоздатьБронированиеКоробокНаСервере(РДанныеДляЧтения)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);

	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла);

	Если рЧтения.Успешно Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = рЧтения.Данные.МВТ;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ КодКоробки КАК КодАгрегации ИЗ ВТ_ДанныеФайла ГДЕ КодКоробки<>"""" УПОРЯДОЧИТЬ ПО КодКоробки ";

		ВыборкаКодыКоробок = Запрос.Выполнить().Выбрать();

		Если ВыборкаКодыКоробок.Количество() > 0 Тогда
			ДокАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Объект.ВыбЗПС,
				Перечисления.ТипыШтрихКодов.Коробка, Перечисления.ТипыУпаковок.МонотоварнаяУпаковка,
				Новый Структура("ВидОперации", Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов));
			Если ЗначениеЗаполнено(ДокАгрегации) Тогда
				Если 1 = 1 Тогда
					ДокОбъект = ДокАгрегации.ПолучитьОбъект();
				Иначе
					ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
				КонецЕсли;

				ДокОбъект.ВидОперацииИСМП = Неопределено;

				ДокОбъект.ПодразделениеНанесения = ПолучитьРеквизитШапки(Объект.ВыбЗПС, "Контрагент");

				ДокОбъект.ШтрихкодыУпаковок.Очистить();
				Пока ВыборкаКодыКоробок.Следующий() Цикл
					СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
					СтрокаТЧ.КодАгрегации = Прав(СокрЛП(ВыборкаКодыКоробок.КодАгрегации), 18);
				КонецЦикла;

				ДокОбъект.фКодыАгрегацийДляПоставщиков	= Истина;
				ДокОбъект.КоличествоКодовSSCC			= ДокОбъект.ШтрихкодыУпаковок.Количество();

				ДокОбъект.Статус = Перечисления.СтатусыДоков_Маркировка.ВРаботе;
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);

				Сообщить("Заполнен доумент: " + ДокАгрегации, СтатусСообщения.Информация);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура кнВынутьКоробкиНаСервере(РДанныеДляЧтения)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Коды = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//Коды = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Коды.Данные.МВТ;

	Запрос.Текст = "
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ ШтрихКодКоробки ПОМЕСТИТЬ ВТ_Коробки ИЗ ВТ_РезультатыПоиска ИНДЕКСИРОВАТЬ ПО ШтрихКодКоробки
				   |;
				   |ВЫБРАТЬ ШтрихКодКоробки ИЗ ВТ_Коробки
				   |;
				   |ВЫБРАТЬ
				   |	ТЧ_Агрегации.ШтрихкодКоробки 			КАК ШтрихкодКоробки,
				   |	ТЧ_Агрегации.Ссылка.Статус 				КАК Статус,
				   |	ТЧ_Агрегации.Ссылка						КАК ДокАгрегации,
				   |	ТЧ_Агрегации.Ссылка.ДокументОснование	КАК ЗПС_Дубль
				   |ИЗ
				   |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ТЧ_Агрегации
				   |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				   |	ВТ_Коробки	
				   |ПО
				   |	ВТ_Коробки.ШтрихкодКоробки = ТЧ_Агрегации.ШтрихкодКоробки
				   |ГДЕ
				   |	ТЧ_Агрегации.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
				   |	И ТЧ_Агрегации.Ссылка.ДокументОснование <> &ВыбЗПС
				   |ИТОГИ ПО
				   |	ЗПС_Дубль,
				   |	ДокАгрегации
				   |";

	Запрос.УстановитьПараметр("ВыбЗПС", Объект.ВыбЗПС);

	РЗапроса = Запрос.ВыполнитьПакет();

	КоробкиКПереносу	= Новый Соответствие;
	Выборка_Коробки		= рЗапроса[рЗапроса.ВГраница() - 1].Выбрать();
	Пока Выборка_Коробки.Следующий() Цикл
		КоробкиКПереносу[Выборка_Коробки.ШтрихКодКоробки] = Истина;
	КонецЦикла;

	Выборка_ЗПС_Дубль	= рЗапроса[рЗапроса.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗПС_Дубль");

	Пока Выборка_ЗПС_Дубль.Следующий() Цикл
		Выборка_ДокАгрегации = Выборка_ЗПС_Дубль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДокАгрегации");
		Пока Выборка_ДокАгрегации.Следующий() Цикл
			Сообщить("Удаление коробок из: " + Выборка_ЗПС_Дубль.ЗПС_Дубль + " " + Выборка_ДокАгрегации.ДокАгрегации
				+ " " + Выборка_ДокАгрегации.Статус);

			ДокАгрегации = Выборка_ДокАгрегации.ДокАгрегации.ПолучитьОбъект();
			Если 1 = 2 Тогда
				ДокАгрегации = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
			КонецЕсли;

			КоробкиТекДокумента = Новый Соответствие;
			СтрокиКУдалению = Новый Массив;
			Для Каждого СтрокаТЧ Из ДокАгрегации.ШтрихкодыУпаковок Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКоробки) И КоробкиКПереносу[СтрокаТЧ.ШтрихкодКоробки]
					<> Неопределено Тогда
					СтрокиКУдалению.Добавить(СтрокаТЧ);
					КоробкиТекДокумента[СтрокаТЧ.ШтрихкодКоробки] = Истина;
				КонецЕсли;
			КонецЦикла;

			Сообщить("	к удалению " + СтрокиКУдалению.Количество() + " строк.");

			Для Каждого Строка Из СтрокиКУдалению Цикл
				ДокАгрегации.ШтрихкодыУпаковок.Удалить(Строка);
			КонецЦикла;

			ДокАгрегации.Записать(?(ДокАгрегации.Проведен, РежимЗаписиДокумента.Проведение,
				РежимЗаписиДокумента.Запись));

			Сообщить("	записан документ: " + ДокАгрегации);

			Если Выборка_ДокАгрегации.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
//				Для Каждого КиЗ Из КоробкиТекДокумента Цикл
//					//Сообщить("		"  + КиЗ.Ключ);			
//				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура кнЗаменитьКодыВФайлеНаСервере(РДанныеДляЧтения,Коробки,ТДокумент = Неопределено)
		
	ТКодыКривые = ПолучитьТаблицуКодыИзСтроки(КодыКривые);
	ТКодыРовные = ПолучитьТаблицуКодыИзСтроки(КодыРовные);
	
	Если тКодыКривые.Количество() = 0 Тогда
		Ошибки = "Не указаны заменяемые коды !";
	Иначе
		Если тКодыРовные.Количество()<>тКодыКривые.Количество() Тогда
			Ошибки = "Не совпадет количество заменяемых и новых кодов !";			
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		Сообщить(Ошибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТЗамены = Новый ТаблицаЗначений;
	ТЗамены.Колонки.Добавить("КодСтарый", 	ПолучитьОписаниеТиповСтроки(200));
	ТЗамены.Колонки.Добавить("КодНовый",	ПолучитьОписаниеТиповСтроки(200));
	
	Для Сч = 0 По тКодыКривые.Количество()-1  Цикл
		СтрокаЗамены = ТЗамены.Добавить();	
		СтрокаЗамены.КодСтарый  = тКодыКривые[Сч].КодУпаковки;
		СтрокаЗамены.КодНовый	= тКодыРовные[Сч].КодУпаковки;	
	КонецЦикла;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, 0);
	
	Если рЧтения.Успешно Тогда
	Иначе
		МаркировкаКС.ВывестиОшибки(рЧтения);
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = рЧтения.Данные.МВТ;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Замена ИЗ &тЗамены КАК тЗамены ИНДЕКСИРОВАТЬ ПО КодСтарый
	|;
	|ВЫБРАТЬ
	|   ВТ_ДанныеФайла.КодКоробки 	КАК КодКоробки,
	|	ВТ_ДанныеФайла.КодУпаковки 	КАК КодСтарый,
	|	ВТ_Замена.КодНовый	 		КАК КодНовый	
	|ИЗ 
	|	ВТ_ДанныеФайла	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Замена
	|ПО
	|	ВТ_ДанныеФайла.КодУпаковки = ВТ_Замена.КодСтарый	
	|ИТОГИ ПО
	|	КодКоробки	
	|";
	
	Запрос.УстановитьПараметр("тЗамены", тЗамены);
	
	Коробки = Новый Массив; 
	
	Макет = ОбработкаОбъект.ПолучитьМакет("ЗаменаКодов");
	
	ТДокумент = Новый ТабличныйДокумент;	
	ТДокумент.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Выборка_КодКоробки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КодКоробки");
	ВсегоСтрок = Выборка_КодКоробки.Количество();
	Сч	= 0;	
	Пока Выборка_КодКоробки.Следующий() Цикл		
		Выборка = Выборка_КодКоробки.Выбрать();
		
		КодыШтук = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.КодНовый) Тогда
				КодыШтук.Добавить(Выборка.КодНовый);
				
				ОблСтрока = Макет.ПолучитьОбласть("Строка");
				ОблСтрока.Параметры.Заполнить(Выборка);
				
				ТДокумент.Вывести(ОблСтрока);
							
			 Иначе
				 КодыШтук.Добавить(Выборка.КодСтарый);
			 КонецЕсли;
		 КонецЦикла;
		 
		 Коробки.Добавить(Новый Структура("unitSerialNumber,sntins", Выборка_КодКоробки.КодКоробки, КодыШтук));
		
		Сч = Сч+1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуКодыИзСтроки(ВходСтрока)
	ТКодов = Новый ТаблицаЗначений;	
	тКодов.Колонки.Добавить("КодУпаковки", ПолучитьОписаниеТиповСтроки(150));
	
	Для Каждого Код Из СтрРазделить(ВходСтрока, Символы.ПС) Цикл
		Если ЗначениеЗаполнено(Код) Тогда
			СтрокаТ = тКодов.Добавить();	
			СтрокаТ.КодУпаковки = Код;		
		КонецЕсли;		
	КонецЦикла;
	
	Возврат тКодов;
КонецФункции //ПолучитьТаблицуКодыИзСтроки(ВходСтрока)


&НаСервере
Процедура кнСоздатьХКМНаСервере()
		
	КодыМаркировки	= ПолучитьКодыИзАгрегаций(Объект.ВыбЗПС);

	Если ЗначениеЗаполнено(Объект.ВыбЗПС) Тогда
		РСозданияХКМ = Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ЗПС_Импорт_ПоОтчетам(Объект.ВыбЗПС, КодыМаркировки);
		Если рСозданияХКМ.Успешно Тогда
			ТекстСообщения = СтрШаблон("Создано: %1 ХКМ к ЗПС: %2.", рСозданияХКМ.ОбработаноОбъектов, Объект.ВыбЗПС);
			Сообщить(ТекстСообщения, СтатусСообщения.Информация);
		Иначе
			МаркировкаКС.ВывестиОшибки(рСозданияХКМ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКодыИзАгрегаций(ЗПС_Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки 				КАК ШтрихкодУпаковки,
	|	ШтрихкодКоробки 				КАК ШтрихкодКоробки,
	|	КодАгрегации 					КАК КодКоробки,
	|	ШтрихкодУпаковки.Наименование 	КАК КодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|ГДЕ	
	|	Ссылка.ДокументОснование = &ЗПС_Ссылка
	|	И Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКоробки.Наименование,
	|	ШтрихкодУпаковки.Наименование
	|";	
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция кнВыгрузитьАгрегациюНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка.ДокументОснование.Организация.ИНН КАК customerINN,
	|	ШтрихкодУпаковки,
	|	ШтрихкодКоробки,
	|	Ссылка.ДокументОснование.Дата 	КАК orderDate,
	|	Ссылка.ДокументОснование.Номер 	КАК orderNumber
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ВыбАгрегация
	|ИТОГИ ПО
	|   Ссылка.ДокументОснование,
	|	ШтрихкодКоробки
	|";
	
	Запрос.УстановитьПараметр("ВыбАгрегация", ВыбАгрегация);
	
	Выборка_ДокументОснование = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДокументОснование");
	Пока Выборка_ДокументОснование.Следующий() Цикл
		Коробки = Новый Массив;	
		
		Выборка_КА = Выборка_ДокументОснование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихкодКоробки");
		Пока Выборка_КА.Следующий() Цикл
			ДанныеКоробки = Новый Структура("unitSerialNumber", ""+Выборка_КА.ШтрихкодКоробки); 
			
			Коды 	= Новый Массив;
			Выборка = Выборка_КА.Выбрать();
			Пока Выборка.Следующий() Цикл
				Коды.Добавить(""+Выборка.ШтрихкодУпаковки);				
			КонецЦикла;	
			ДанныеКоробки.Вставить("sntins", Коды);
			
			Коробки.Добавить(ДанныеКоробки);
		КонецЦикла;
		
		Данные	= Новый Структура("customerINN,orderNumber,orderDate,aggregationUnits",
		Выборка_ДокументОснование.customerINN, Выборка_ДокументОснование.orderNumber, Выборка_ДокументОснование.orderDate,
		Коробки
		);				
		
		
	КонецЦикла;
	
	Возврат Данные; 
КонецФункции

&НаСервере
Процедура кнЗаполнитьСоставАгрегационныхКодовНаСервере()
	Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставАгрегационныхКодов(ВыбАгрегация);
КонецПроцедуры

&НаСервере
Процедура кнПрописатьНоменклатуруВАКНаСервере()	
    
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	ШтрихкодКоробки 			КАК ШтрихкодКоробки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И ШтрихкодКоробки.Владелец.ВерсияДанных ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбАгрегация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
					
		СпрОбъект = Выборка.ШтрихкодКоробки.ПолучитьОбъект();	
		СпрОбъект.Владелец = Выборка.Номенклатура;
		СпрОбъект.Записать();
		
		ВсегоСтрок = ВсегоСтрок-1;
		
	КонецЦикла; 
	
	//ЗавершитьОповещение = Истина; 

КонецПроцедуры

&НаСервере
Процедура кнЗарегитьКодыПоЗаказуНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =" 
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ЗаказКМ.ДокументОснование = &ЗПС_Ссылка
	|";
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", Объект.ВыбЗПС);
	
	Получатель = ПланыОбмена.ДанныеЧЗ.НайтиПоКоду("OD7cz"); 
	
	Выборка 	= Запрос.Выполнить().Выбрать();	
	//ВсегоСтрок 	= Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);		 
	КонецЦикла; 
	
	//ЗавершитьОповещение = истина; 
	
КонецПроцедуры

&НаСервере
Процедура кнЗарегистрироватьКоробкиПоЗПСНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодКоробки	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|ГДЕ	
	|	Ссылка.ДокументОснование = &ЗПС_Ссылка
	|	И Ссылка.ВидОперации = &ВидОперации
	|";
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", Объект.ВыбЗПС);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийМаркировки.Агрегация);
	
	Получатель = ПланыОбмена.ДанныеЧЗ.НайтиПоКоду("OD7cz"); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок 	= Выборка.Количество();
	Сообщить("К регистрации " + ВсегоСтрок);
	
	Пока Выборка.Следующий() Цикл				
		ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.ШтрихкодКоробки);		
		
	КонецЦикла; 	

КонецПроцедуры
&НаСервере
Функция ВыполнитьШагПроверки_НайденыДокументыПоГУИД(МВТ)
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Данные = Новый Структура("Имя,МакетОтчета,рЗапроса", "Ненайденные ЗПС/КП по идентификатору", "НеНайденыДокументы", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"	 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|ЗПС_Строка	КАК ГУИД
	|ИЗ ВТ_РезультатыПоиска
	|ГДЕ 
	|ВТ_РезультатыПоиска.ЗПС_ссылка = Значение(Документ.ЗаказПоставщику.ПустаяСсылка) 	  
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|КП_Строка
	|ИЗ ВТ_РезультатыПоиска
	|ГДЕ 
	|ВТ_РезультатыПоиска.КП_ссылка = Значение(Документ.КонтрактСПроизводителем.ПустаяСсылка)  
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(СтрШаблон("Не найден ЗПС/КП по идентификатору %1.", Выборка.ГУИД));	
		
	КонецЦикла;	
	Результат.Данные.рЗапроса = Запрос.Выполнить();
	Возврат Результат;	
КонецФункции

&НаСервере
Процедура ПроверитьДанныеФайла_2НаСервере(РДанныеДляЧтения,ТабДокДополнительно = неопределено,ИмяТД = "")
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла,истина);

	Если рЧтения.Успешно Тогда
		Сообщить(СтрШаблон("Прочитано: %1 кодов, %2 коробок.", рЧтения.Данные.КолКодовШтук,
			рЧтения.Данные.КолКодовКоробок));

		РПроверок = ПроверитьДанныеФайлаСПроверкой(рЧтения.Данные.МВТ);
		ВывестиРезультатыПроверок(рПроверок);
	Иначе
		МаркировкаКС.ВывестиОшибки(рЧтения);		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура кнПоказатьДанныеФайла_2НаСервере(РДанныеДляЧтения,ТабДокумент = неопределено)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла,истина);
	Если Не рЧтения.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рЧтения);
		Возврат;
	КонецЕсли;

	Сообщить(СтрШаблон("Прочитано: %1 кодов, %2 коробок.", рЧтения.Данные.КолКодовШтук, рЧтения.Данные.КолКодовКоробок));

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = рЧтения.Данные.МВТ;
	Запрос.Текст = "
				   |ВЫБРАТЬ 
				   |	ЗПС_Ссылка 							КАК ЗПС,
				   |	КП_Ссылка 							КАК КП,
				   |	ШтрихкодУпаковки.Владелец.Родитель 	КАК Модель,
				   |	ШтрихкодУпаковки.Владелец 			КАК Номенклатура,
				   |	ШтрихкодКоробки,		
				   |	СУММА(1) КАК КоличествоФайл,
				   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки.Владелец) КАК КолПозицийВКоробке
				   |ИЗ 
				   |	ВТ_РезультатыПоиска 
				   |СГРУППИРОВАТЬ ПО 
				   |	ЗПС_Ссылка,
				   |	КП_Ссылка,
				   |	ШтрихкодУпаковки.Владелец,
				   |	ШтрихкодКоробки
				   |";

	ТабДокумент = Новый ТабличныйДокумент;

	РЗапроса		= Запрос.Выполнить();

	ПараметрыДанных	= Новый Структура("ЗПС_Ссылка", Объект.ВыбЗПС);
	ДопПараметры	= Новый Структура("ТД_Результат,ВнешниеДанные", ТабДокумент, Новый Структура("ДанныеОтчета",
		рЗапроса));

	Обр 			= Обработки.ПроверкаКарточекДляНК.Создать();
	Обр.ВывестиСхемуВТД(ОбработкаОбъект.ПолучитьМакет("СодержимоеОтчетаОНанесении_2"), "Основной",
		ПараметрыДанных, ДопПараметры);	
КонецПроцедуры

&НаСервере
Процедура кнЗаполнитьЗПСНаСервере(РДанныеДляЧтения)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	РЧтения = ПрочитатьКодыНаСервере(РДанныеДляЧтения,ВидОперации = 1);
	//РЧтения = ОбработкаОбъект.ПрочитатьКоды(Объект.ИмяФайла, фЗагружатьИзФайла,истина);
	Если Не рЧтения.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рЧтения);
		Возврат;
	КонецЕсли;

	Сообщить(СтрШаблон("Прочитано: %1 кодов, %2 коробок.", рЧтения.Данные.КолКодовШтук, рЧтения.Данные.КолКодовКоробок));
	
	МожноЗагружать = Истина; 
	РПроверок = ПроверитьДанныеФайлаСПроверкой(рЧтения.Данные.МВТ);
	Для Каждого ЭлМассиваПроверок Из РПроверок Цикл
		Если НЕ ЭлМассиваПроверок.Успешно Тогда
			МожноЗагружать = Ложь; 	
		КонецЕсли;
	КонецЦикла;
	Если НЕ МожноЗагружать Тогда
		ВывестиРезультатыПроверок(РПроверок); 
		Возврат; 
	КонецЕсли;
	ВыполнитьЗагрузкуДанныхвЗПС(рЧтения.Данные.МВТ);    
	
КонецПроцедуры
&НаСервере
Процедура ВыполнитьЗагрузкуДанныхвЗПС(МВТ)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	 Запрос.текст =  "ВЫБРАТЬ
	                 |	ВТ_РезультатыПоиска.ЗПС_Ссылка КАК ЗПС,
	                 |	ВТ_РезультатыПоиска.КП_Ссылка КАК КП,
	                 |	ВТ_РезультатыПоиска.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	                 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_РезультатыПоиска.ШтрихкодУпаковки) КАК Количество
	                 |ИЗ
	                 |	ВТ_РезультатыПоиска КАК ВТ_РезультатыПоиска
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ВТ_РезультатыПоиска.ЗПС_Ссылка,
	                 |	ВТ_РезультатыПоиска.КП_Ссылка,
	                 |	ВТ_РезультатыПоиска.ШтрихкодУпаковки.Владелец
	                 |ИТОГИ ПО
	                 |	ЗПС,
	                 |	КП
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                 |	ВТ_РезультатыПоиска.ЗПС_Ссылка КАК ЗПС,
	                 |	ВТ_РезультатыПоиска.КП_Ссылка КАК КП,
	                 |	ВТ_РезультатыПоиска.ШтрихкодКоробки КАК ШтрихкодКоробки,
	                 |	МаркировкаТоваровИСМП.Ссылка КАК ОМ
	                 |ПОМЕСТИТЬ ВТКоробкиДляИзменения
	                 |ИЗ
	                 |	ВТ_РезультатыПоиска КАК ВТ_РезультатыПоиска
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	                 |		ПО ВТ_РезультатыПоиска.КП_Ссылка = МаркировкаТоваровИСМП.ДокументОснование
	                 |			И (МаркировкаТоваровИСМП.Проведен)
	                 |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	                 |		ПО (МаркировкаТоваровИСМП.Ссылка = МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка)
	                 |			И ВТ_РезультатыПоиска.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки
	                 |			И ВТ_РезультатыПоиска.ШтрихкодУпаковки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки
	                 |ГДЕ
	                 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка ЕСТЬ NULL
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ВТКоробкиДляИзменения.ОМ КАК ОМ,
	                 |	ВТ_РезультатыПоиска.ШтрихкодКоробки КАК ШтрихкодКоробки,
	                 |	ВТ_РезультатыПоиска.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	                 |ИЗ
	                 |	ВТКоробкиДляИзменения КАК ВТКоробкиДляИзменения
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезультатыПоиска КАК ВТ_РезультатыПоиска
	                 |		ПО (ВТ_РезультатыПоиска.ЗПС_Ссылка = ВТКоробкиДляИзменения.ЗПС)
	                 |			И (ВТ_РезультатыПоиска.КП_Ссылка = ВТКоробкиДляИзменения.КП)
	                 |			И (ВТ_РезультатыПоиска.ШтрихкодКоробки = ВТКоробкиДляИзменения.ШтрихкодКоробки)
	                 |ИТОГИ ПО
	                 |	ОМ,
	                 |	ШтрихкодКоробки";
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаЗПС = ПакетРезультатов[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАгрегации = ПакетРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	НачатьТранзакцию();
	МассивОбъектов = Новый Массив;  
	Пока ВыборкаЗПС.Следующий() Цикл
		ЗПСОбъект = ВыборкаЗПС.ЗПС.ПолучитьОбъект(); 
		ЗПСОбъект.Товары.Очистить(); 
		ВыборкаКП = ВыборкаЗПС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаКП.Следующий() Цикл
			ВыборкаТовары = ВыборкаКП.Выбрать(); 
			Пока ВыборкаТовары.Следующий() Цикл
				НоваяСтрока = ЗПСОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТовары);
				НоваяСтрока.ЗаявкаПоставщику =  ВыборкаКП.КП; 
				ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ЗПСОбъект);
				РассчитатьСуммуТабЧасти(НоваяСтрока,ЗПСОбъект,"ОтВсего");
			КонецЦикла;
		КонецЦикла;
		ЗПСОбъект.Записать();
		МассивОбъектов.Добавить(ЗПСОбъект.ссылка);  		
	КонецЦикла;
	
	Пока ВыборкаАгрегации.Следующий() Цикл
		ОперацияМаркировкаОб = ВыборкаАгрегации.ОМ.ПолучитьОбъект();
		ВыборкаКороб = ВыборкаАгрегации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКороб.Следующий() Цикл
			Отбор = Новый Структура("ШтрихкодКоробки", ВыборкаКороб.ШтрихкодКоробки);
			СтрокиКороба = ОперацияМаркировкаОб.ШтрихкодыУпаковок.НайтиСтроки(Отбор);
			Если СтрокиКороба.Количество() > 0 Тогда
				Для Каждого СтрокаКороба Из СтрокиКороба Цикл
					ОперацияМаркировкаОб.ШтрихкодыУпаковок.Удалить(СтрокаКороба);
				КонецЦикла;
			КонецЕсли;
			ВыборкаКМ = ВыборкаКороб.Выбрать();
			Пока ВыборкаКМ.Следующий() Цикл
				СтрокаКороба  = ОперацияМаркировкаОб.ШтрихкодыУпаковок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаКороба, ВыборкаКМ);
			КонецЦикла;
		КонецЦикла;
		ОперацияМаркировкаОб.Записать();
		
		МассивОбъектов.Добавить(ОперацияМаркировкаОб.ссылка);
	КонецЦикла;
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();

		Сообщить("Были внесены измненения в объекты:" + Символы.ПС + СтрСоединить(МассивОбъектов, Символы.пс));

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьКодыНаКлиенте()
	
	МассивДанныхДляЧтения = Новый Массив; 
	Если фЗагружатьИзФайла = 0 Тогда
		ДДанные = Новый ДвоичныеДанные(Объект.ИмяФайла);
		СтрокаДанных = ПолучитьСтрокуИзДвоичныхДанных(ДДанные);
		МассивДанныхДляЧтения.Добавить(СтрокаДанных); 
		//Возврат	ПрочитатьКодыИзФайлаНаКлиенте(Объект.ИмяФайла,НаполнениеЗПС);
		
	Иначе
		Файл = Новый Файл(Объект.ИмяФайла);					
		Если Файл.ЭтоКаталог() Тогда            
			КаталогЗагрузки = Файл.ПолноеИмя; 
		Иначе
			КаталогЗагрузки = Файл.Путь;			
		КонецЕсли;
		Если НЕ СтрЗаканчиваетсяНа(КаталогЗагрузки, ПолучитьРазделительПути()) Тогда
			КаталогЗагрузки = КаталогЗагрузки + ПолучитьРазделительПути();		
		КонецЕсли;
		
		Файлы = НайтиФайлы(КаталогЗагрузки,"*.json");
		//МассивДанных = Новый Массив; 
		Для каждого Файл Из Файлы Цикл        
			мИмяФайла = Файл.ПолноеИмя;
			
			ДДанные = Новый ДвоичныеДанные(мИмяФайла);
			СтрокаДанных	= ПолучитьСтрокуИзДвоичныхДанных(ДДанные);
			
			//Если НаполнениеЗПС Тогда
			//	рЧтения 		= ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПСНаСервере(СтрокаДанных);
			//Иначе
			//	рЧтения 		= ПрочитатьТаблицуКодовИзСтрокиНаСервере(СтрокаДанных);
			//КонецЕсли;
			//МассивДанных.Добавить(рЧтения);  
			 //++Данилова Е.В. 28.05.2026 MARK-3727
			  МассивДанныхДляЧтения.Добавить(СтрокаДанных);
			 //--Данилова Е.В. 28.05.2026 
		КонецЦикла;
		//Возврат ПрочитатьКодыИзКаталогаНаКлиенте(КаталогЗагрузки,НаполнениеЗПС);
		//++Данилова Е.В. 28.05.2026 MARK-3727
		// МассивДанныхДляЧтения.Добавить(СтрокаДанных);
		//--Данилова Е.В. 28.05.2026 
	 КонецЕсли;
	 
	 Возврат МассивДанныхДляЧтения; 
 КонецФункции 
 
 // <Описание функции>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 &НаСервере
 Функция ПрочитатьКодыНаСервере(МассивДанныхДляЧтения,НаполнениеЗПС) 
	 МассивДанных = Новый Массив;
	 Для каждого СтрокаДанных Из МассивДанныхДляЧтения Цикл
		 
		 Если НаполнениеЗПС Тогда
			 РЧтения = ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПСНаСервере(СтрокаДанных,ложь);
		 Иначе 
			 рЧтения = ПрочитатьТаблицуКодовИзСтрокиНаСервере(СтрокаДанных,ложь);	
		 КонецЕсли;
		 
		 МассивДанных.Добавить(рЧтения);	 
	 КонецЦикла;
	 //МассивДанных.Добавить(рЧтения);
	 
	 Возврат СопоставитьДанныеИзКаталогаНаСервере(МассивДанных,НаполнениеЗПС);
 КонецФункции // ПрочитатьКодыНаСервере()
 

//&НаКлиенте
//Функция ПрочитатьКодыИзФайлаНаКлиенте(ИмяФайла,НаполнениеЗПС = Ложь)
//	//Результат = МаркировкаКС.СтруктураРезультата(Истина);
//	
//	ДДанные = Новый ДвоичныеДанные(ИмяФайла);
//	СтрокаДанных = ПолучитьСтрокуИзДвоичныхДанных(ДДанные);
//	
//	Если НаполнениеЗПС Тогда
//		РЧтения = ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПСНаСервере(СтрокаДанных);
//	Иначе 
//		рЧтения = ПрочитатьТаблицуКодовИзСтрокиНаСервере(СтрокаДанных);	
//	КонецЕсли;
//	 
//	Возврат рЧтения; 
//	
//КонецФункции

&НаСервере
Функция ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПСНаСервере(СтрокаДанных,СопоставитьКоды = истина)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	РЧтения = ОбработкаОбъект.ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПС(СтрокаДанных); 
	Если СопоставитьКоды Тогда
		Возврат ОбработкаОбъект.СопоставитьКоды(рЧтения.Коды,истина);
	Иначе
		Возврат РЧтения;
	КонецЕсли;
	 
КонецФункции

&НаСервере
Функция ПрочитатьТаблицуКодовИзСтрокиНаСервере(СтрокаДанных,СопоставитьКоды = истина)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	РЧтения = ОбработкаОбъект.ПрочитатьТаблицуКодовИзСтроки(СтрокаДанных); 
	Если СопоставитьКоды Тогда
		Возврат ОбработкаОбъект.СопоставитьКоды(рЧтения.Коды);
	Иначе
		Возврат РЧтения;
	КонецЕсли;
КонецФункции

//&НаКлиенте
//Функция ПрочитатьКодыИзКаталогаНаКлиенте(КаталогЗагрузки,НаполнениеЗПС = Ложь)
//	Файлы = НайтиФайлы(КаталогЗагрузки,"*.json");
//	МассивДанных = Новый Массив; 
//	Для каждого Файл Из Файлы Цикл        
//		мИмяФайла = Файл.ПолноеИмя;
//		
//		ДДанные = Новый ДвоичныеДанные(мИмяФайла);
//		СтрокаДанных	= ПолучитьСтрокуИзДвоичныхДанных(ДДанные);
//		
//		Если НаполнениеЗПС Тогда
//			рЧтения 		= ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПСНаСервере(СтрокаДанных);
//		Иначе
//			рЧтения 		= ПрочитатьТаблицуКодовИзСтрокиНаСервере(СтрокаДанных);
//		КонецЕсли;
//		МассивДанных.Добавить(рЧтения);  
//		
//	КонецЦикла;
//	Возврат СопоставитьДанныеИзКаталогаНаСервере(МассивДанных,НаполнениеЗПС); 
//КонецФункции

&НаСервере
Функция СопоставитьДанныеИзКаталогаНаСервере(МассивДанных,НаполнениеЗПС)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	Если НаполнениеЗПС Тогда
		ТКоды = ОбработкаОбъект.СоздатьТаблицуКодов_2(); 
	Иначе 
		ТКоды = ОбработкаОбъект.СоздатьТаблицуКодов();	
	КонецЕсли;
	Для Каждого рЧтения Из МассивДанных Цикл
		Для Каждого СтрокаИст Из рЧтения.Коды Цикл
				СтрокаПол = тКоды.Добавить();			
				ЗаполнитьЗначенияСвойств(СтрокаПол, СтрокаИст);		
			КонецЦикла;
	КонецЦикла;
	
	Возврат ОбработкаОбъект.СопоставитьКоды(ТКоды,НаполнениеЗПС);
КонецФункции
#КонецОбласти
